{
  "_name_or_path": "/content/trainer/september_28",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-GOVERNMENT",
    "2": "I-GOVERNMENT",
    "3": "B-PRIVATE",
    "4": "I-PRIVATE",
    "5": "B-MALE",
    "6": "I-MALE",
    "7": "B-FEMALE",
    "8": "I-FEMALE",
    "9": "B-PROVINCE_2",
    "10": "I-PROVINCE_2",
    "11": "B-PROVINCE_5",
    "12": "I-PROVINCE_5",
    "13": "B-OTHER_PROVINCES",
    "14": "I-OTHER_PROVINCES",
    "15": "B-MADHESI_OTHER_CAST",
    "16": "I-MADHESI_OTHER_CAST",
    "17": "B-MADHESI_DALIT",
    "18": "I-MADHESI_DALIT",
    "19": "B-HILL_DALIT",
    "20": "I-HILL_DALIT",
    "21": "B-MOUNTAIN_HILL_JANAJATI",
    "22": "I-MOUNTAIN_HILL_JANAJATI",
    "23": "B-TERAI_JANAJATI",
    "24": "I-TERAI_JANAJATI",
    "25": "B-MUSLIM",
    "26": "I-MUSLIM",
    "27": "B-OTHER_MARGINALIZED",
    "28": "I-OTHER_MARGINALIZED",
    "29": "B-BRAHMIN",
    "30": "I-BRAHMIN",
    "31": "B-THAKURI",
    "32": "I-THAKURI",
    "33": "B-CHETTRI",
    "34": "I-CHETTRI",
    "35": "B-UPPER_CASTE_NEWAR",
    "36": "I-UPPER_CASTE_NEWAR"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-BRAHMIN": 29,
    "B-CHETTRI": 33,
    "B-FEMALE": 7,
    "B-GOVERNMENT": 1,
    "B-HILL_DALIT": 19,
    "B-MADHESI_DALIT": 17,
    "B-MADHESI_OTHER_CAST": 15,
    "B-MALE": 5,
    "B-MOUNTAIN_HILL_JANAJATI": 21,
    "B-MUSLIM": 25,
    "B-OTHER_MARGINALIZED": 27,
    "B-OTHER_PROVINCES": 13,
    "B-PRIVATE": 3,
    "B-PROVINCE_2": 9,
    "B-PROVINCE_5": 11,
    "B-TERAI_JANAJATI": 23,
    "B-THAKURI": 31,
    "B-UPPER_CASTE_NEWAR": 35,
    "I-BRAHMIN": 30,
    "I-CHETTRI": 34,
    "I-FEMALE": 8,
    "I-GOVERNMENT": 2,
    "I-HILL_DALIT": 20,
    "I-MADHESI_DALIT": 18,
    "I-MADHESI_OTHER_CAST": 16,
    "I-MALE": 6,
    "I-MOUNTAIN_HILL_JANAJATI": 22,
    "I-MUSLIM": 26,
    "I-OTHER_MARGINALIZED": 28,
    "I-OTHER_PROVINCES": 14,
    "I-PRIVATE": 4,
    "I-PROVINCE_2": 10,
    "I-PROVINCE_5": 12,
    "I-TERAI_JANAJATI": 24,
    "I-THAKURI": 32,
    "I-UPPER_CASTE_NEWAR": 36,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.28.0",
  "vocab_size": 30522
}
